ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/I2S0_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="I2S0" HW_revision="1.0">
    <group id="I2S0_GPRCM" name="I2S0_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="I2S0_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="I2S0_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="I2S0_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="DAICLK" description="Audio clock" begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="SYSOSC" value="0x0" description="SYSOSC"/>
                <bitenum id="HFXT" value="0x1" description="HF crystal"/>
                <bitenum id="PLL" value="0x2" description="PLL"/>
            </bitfield>
        </register>
        <register id="I2S0_GPRCM_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="I2S0_PDBGCTL" width="32" offset="0x1008" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="IMMEDIATE" value="0x0" description="The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="I2S0_CPU_INT" name="I2S0_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="I2S0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MIS registers. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="WCLKERR" value="0x1" description="WCLK Error"/>
                <bitenum id="RXIFG" value="0x2" description="Receive interrupt; Interrupt Flag: RX"/>
                <bitenum id="TXIFG" value="0x3" description="Transmit interrupt; Interrupt Flag: TX"/>
                <bitenum id="RXFIFO_OFV_EVT" value="0x4" description="RX FIFO Overflow Event/interrupt pending"/>
                <bitenum id="TXFIFO_UNF_EVT" value="0x5" description="TX FIFO underflow interrupt"/>
                <bitenum id="DMA_DONE_RX" value="0x10" description="DMA DONE on RX"/>
                <bitenum id="DMA_DONE_TX" value="0x11" description="DMA DONE on TX"/>
                <bitenum id="DMA_PREIRQ_RX" value="0x13" description="DMA PRE IRQ INTERRUPT"/>
                <bitenum id="DMA_PREIRQ_TX" value="0x14" description="DMA PRE IRQ INTERRUPT"/>
            </bitfield>
        </register>
        <register id="I2S0_IMASK" width="32" offset="0x8" description="Interrupt Mask Register

Selects mask states of the flags in [IRQFLAGS.*] that contribute to the I2S_IRQ event.">
            <bitfield id="WCLKERR" description="WCLKERR interrupt mask" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DIS" value="0x0" description="Disable the interrupt mask"/>
                <bitenum id="EN" value="0x1" description="Enable the interrupt mask"/>
            </bitfield>
            <bitfield id="RXINT" description="Enable Receive Interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXINT" description="Enable Transmit Interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="RXFIFO overflow event mask." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="TX FIFO underflow interrupt mask" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="I2S0_RIS" width="32" offset="0x10" description="This registers gives the raw interrupt status">
            <bitfield id="WCLKERR" description="This interrupt is set when: 
- An unexpected WCLK edge occurs during the data delay period of a phase.  Note unexpected WCLK edges during the word and idle periods of the phase are not detected.
-  In dual-phase mode, when two WCLK edges are less than 4 BCLK cycles apart.
-  In single-phase mode, when a WCLK pulse occurs before the last channel.
This error requires a complete restart since word synchronization has been lost." begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RXINT" description="Receive Interrupt." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="TXINT" description="Transmit Interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="TX FIFO Underflow Interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
